app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "fasd"], ["text", "asdf"], ["created_at", "2017-03-17 04:56:36.092739"], ["updated_at", "2017-03-17 04:56:36.092739"]]
---
  def create
    ## render plain: params[:article].inspect

    @article = Article.new(article_params)

    if @article.save